In [47]:
import pandas as pd
block = pd.read_clipboard(sep='\t')
block

                   т/к «СП Дудинка»
0                   Дисп 05/04-2024
1                       1 1805/0800
2                    2 6458N/04000E
3                          4 140/13
4                           5 140/1
5                31 279.868/138.153
6                    43 Архангельск
7                      26 1805/0045
8   27 По указанию от судовладельца
9                             100 –
10            Капитан Корнилов Н.В.

In [48]:
COLUMN_NAMES = [l for l in range(0, 104)]
df = pd.DataFrame(columns=COLUMN_NAMES, index=[0])
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [49]:
block.T.reset_index().values

array([['т/к «СП Дудинка»', 'Дисп 05/04-2024', '1 1805/0800',
        '2 6458N/04000E', '4 140/13', '5 140/1', '31 279.868/138.153',
        '43 Архангельск', '26 1805/0045',
        '27 По указанию от судовладельца', '100 –',
        'Капитан Корнилов Н.В.']], dtype=object)

In [50]:
list_data = block.T.reset_index().values
list_data[0][1].split()

['Дисп', '05/04-2024']

In [51]:
list_data

array([['т/к «СП Дудинка»', 'Дисп 05/04-2024', '1 1805/0800',
        '2 6458N/04000E', '4 140/13', '5 140/1', '31 279.868/138.153',
        '43 Архангельск', '26 1805/0045',
        '27 По указанию от судовладельца', '100 –',
        'Капитан Корнилов Н.В.']], dtype=object)

In [52]:
len(list_data[0])

12

In [53]:
for i in range(len(list_data[0])):
    if list_data[0][i].split()[0].isdigit():
        df.iloc[0, int(list_data[0][i].split()[0])] = ' '.join(list_data[0][i].split()[1:][:])
    elif list_data[0][i].split()[0] == 'т/к':
        df.iloc[0, 0] = list_data[0][i][4:]
    elif list_data[0][i].split()[0].lower() == 'дисп':
        df.iloc[0, 102] = list_data[0][i].split()[1]
    else:
        df.iloc[0, 103] = list_data[0][i]

In [54]:
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,«СП Дудинка»,1805/0800,6458N/04000E,NaN,140/13,140/1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,–,NaN,05/04-2024,Капитан Корнилов Н.В.

In [55]:
df.dropna(axis=1).info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 0 to 0
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1 non-null      object
 1   1       1 non-null      object
 2   2       1 non-null      object
 3   4       1 non-null      object
 4   5       1 non-null      object
 5   26      1 non-null      object
 6   27      1 non-null      object
 7   31      1 non-null      object
 8   43      1 non-null      object
 9   100     1 non-null      object
 10  102     1 non-null      object
 11  103     1 non-null      object
dtypes: object(12)
memory usage: 104.0+ bytes

In [56]:
df.dropna(axis=1)

,0,1,2,4,5,26,27,31,43,100,102,103
0,«СП Дудинка»,1805/0800,6458N/04000E,140/13,140/1,1805/0045,По указанию от судовладельца,279.868/138.153,Архангельск,–,05/04-2024,Капитан Корнилов Н.В.

In [57]:
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,«СП Дудинка»,1805/0800,6458N/04000E,NaN,140/13,140/1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,–,NaN,05/04-2024,Капитан Корнилов Н.В.

In [58]:
len(df.values.tolist()[0])

104

In [59]:
daily_list = df.values.tolist()[0]

In [60]:
daily_list

['«СП Дудинка»',
 '1805/0800',
 '6458N/04000E',
 nan,
 '140/13',
 '140/1',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 '1805/0045',
 'По указанию от судовладельца',
 nan,
 nan,
 nan,
 '279.868/138.153',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 'Архангельск',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 '–',
 nan,
 '05/04-2024',
 'Капитан Корнилов Н.В.']

In [61]:
pd.DataFrame(daily_list).T

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,«СП Дудинка»,1805/0800,6458N/04000E,NaN,140/13,140/1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,–,NaN,05/04-2024,Капитан Корнилов Н.В.